Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In the example above, we applied the Java plugin which, among other things, did the following:
zh_cn: 在上面的示例中，我们应用 Java 插件，除其他外，还做了下列操作：

source: In the examples above, it is still possible to execute taskY without causing taskX to run:
zh_cn: 在上面的例子中，它仍有可能执行taskY而不会导致taskX也运行：

source: In the following example, we create an Ant path object, then iterate over the contents of it.
zh_cn: 在以下示例中，我们创建一个 Ant 的 path对象，然后循环访问它的内容。

source: In the introductory tutorial (Chapter 6, Build Script Basics) you have learned how to create simple tasks.
zh_cn: 在入门教程 （第 6 章，构建脚本基础） 中，你已经学习了如何创建简单的任务。

source: In the javadoc you can see the possible attributes you can set for a particular element.
zh_cn: 在javadoc 中你可以看到可能的属性，这些属性你可以设置为特定的元素。

source: In the last example only one action was down the hierarchy and therefore it was the only task that got executed.
zh_cn: 在上一个例子中只有一个action是在这个层次结构下，因此它是唯一一个被执行的任务。

source: In the latter case, an ivy.xml descriptor in the repository is supposed to contain all the necessary information.
zh_cn: 在后者的情况下，这个仓库的 ivy.xml描述符应该包含所有必要的信息。

source: In the long term, this mode will become the default mode, possibly the only mode for Gradle build execution.
zh_cn: 长远来看，这种模式将成为默认模式，可能会是 Gradle 构建执行的唯一模式。

source: In the settings file you can use a set of methods to build the project tree.
zh_cn: 在设置文件中你可以使用一套方法来生成项目树。

source: In the tutorial in Chapter 7, Java Quickstart we used, for example, the apply() method.
zh_cn: 在第 7 章， Java 快速入门的教程中，我们使用了 apply ()方法。

source: In this case the native Maven code we delegate to needs additional libraries.
zh_cn: 在这种情况下，我们必须将委派本地的Maven代码给第三方库实现。

source: In this case you can add an environment property in the project administration section (invisible to normal users).
zh_cn: 在这种情况下，您可以在项目管理部分 （对普通用户不可见） 添加一个环境属性。

source: In this case you can directly sign the task that produces the artifact to sign.
zh_cn: 在这种情况下，你可以直接签名生成了要签名的artifact 的任务。

source: In this chapter we will discuss how to use plugins and the terminology and concepts surrounding plugins.
zh_cn: 在这一章中，我们将讨论如何使用插件以及术语和插件相关的概念。

source: In this example :services:personservice depends on both :api and :shared.
zh_cn: 在这个例子中 :services:personservice 同时依赖于 :api 和 :shared。

source: In this example we create an additional library containing only the interfaces of the api project.
zh_cn: 在这个示例中，我们创建了一个额外的的库，它只包含api项目的接口。

source: In this example, an ext block adds two extra properties to the project object.
zh_cn: 在此示例中， 一个ext代码块将两个额外属性添加到project对象中。

source: In this example, we only want to require signing if we are building a release version and we are going to publish it.
zh_cn: 在此示例中，我们只想要在我们构建一个我们即将去发布的发布版本的时候，才进行签名。

source: In this example, we pass the message for the echo task as nested text:
zh_cn: 在此示例中，我们将把作为嵌套文本的消息传给 echo 任务：

source: In this mode, Gradle configures only relevant projects (see Section 56.1.1.1, “Configuration on demand”).
zh_cn: 在此模式下，Gradle 只配置相关的项目（见第 56.1.1.1 节，“Configuration on demand"）。

source: In this way, enhanced tasks let you reuse a piece of behaviour in many different places, possibly across different builds.
zh_cn: 通过这种方式，增强型的任务能够让你在许多不同的地方，甚至是跨越不同的构建，利用同样的行为。

source: In your build script, a property called ant is provided by Gradle.
zh_cn: 在构建脚本中，Gradle 提供了一个名为 ant 的属性。

source: Incremental compilation
zh_cn: 增量编译

source: Incremental compilation requires dependency analysis of the source code.
zh_cn: 增量编译需要源代码的相关性分析。

source: Incubating integration plugins
zh_cn: 孵化中的集成插件

source: Incubating language plugins
zh_cn: 正在孵化的语言插件

source: Incubating software development plugins
zh_cn: 孵化中的软件开发插件

source: Information messages
zh_cn: 信息性消息

source: Information pertaining to the analysis as a whole, like server and database connections settings, have to be configured in the sonarRunner block of this project.
zh_cn: 与分析有关的信息作为一个整体，比如服务器和数据库的连接设置，必须在这一个 project 的sonarRunner块中进行配置。

source: Initialization
zh_cn: 初始化

source: Installing Gradle
zh_cn: 安装 Gradle

source: Installs the application into a specified directory.
zh_cn: 将应用程序安装到指定的目录。

source: Installs the associated artifacts to the local Maven cache, including Maven metadata generation.
zh_cn: 将相关的构件安装到本地的 Maven 缓存，包括 Maven 元数据的生成。

source: Instead of using a task name, you can define a dependency using a Task object, as shown in this example:
zh_cn: 您可以使用一个Task对象而不是任务名称来定义依赖，如下：

source: Instead, we plan to enhance Gradle's own compiler daemon to stay alive across Gradle invocations, reusing the same Scala compiler.
zh_cn: 相反，我们打算加强 Gradle 自己的编译器守护进程，使得在跨 Gradle 调用时继续存活，利用同一个 Scala 编译器。

source: Instructions for mapping Gradle configurations to Maven scopes.
zh_cn: 将Gradle配置映射到Maven scopes的说明。

source: Integration plugins
zh_cn: 集成插件

source: IntelliJ IDEA Integration
zh_cn: IntelliJ IDEA 集成

source: Internally, eclipse-wtp also applies the eclipse plugin so you don't need to apply both of those plugins.
zh_cn: 在内部， eclipse wtp也应用了eclipse插件，所以你不需要同时应用这两个插件。

source: Internally, Gradle uses Ant and Ivy.
zh_cn: Gradle 内部使用 Ant 和 Ivy。

source: Introduction
zh_cn: 介绍

source: Is this cool or is this cool?
zh_cn: 是刚才的那个酷还是现在的这个酷？

source: It adds a default EAR archive task.
zh_cn: 它添加了一个默认的EAR archive task。

source: It adds an instance for each source set in the project.
zh_cn: 它为该project里的每个源集添加一个实例。

source: It allows Gradle to provide conciseness through convention-over-configuration and sensible defaults yet not require complete reconfiguration if a conventional default needs to be changed.
zh_cn: 它可以令 Gradle 通过约定优于配置及合理的默认值来实现简洁的配置方式。而且，如果默认约定需要进行修改时，也不需要进行完全的重新配置。

source: It allows running and bundling applications for the jvm.
zh_cn: 它允许为 jvm 运行和捆绑应用程序。

source: It allows you to add conditional execution of the built-in actions of such a task.
zh_cn: 它允许您向一个任务的内置操作中添加执行条件。

source: It also adds the dependencies of the other project to the classpath.
zh_cn: 它也把其他项目的依赖添加到类路径中。

source: It also can be used to force versions of first level dependencies.
zh_cn: 它也可以用于强制第一级依赖的版本。

source: It also creates a single distribution in the distributions container extension named "main".
zh_cn: 它还在分发容器扩展中创建了一个名为“main”的 distribution。

source: It also generates a report once test execution is complete.
zh_cn: 测试执行完成后，它还会生成一份报告。

source: It also leverages the wrapper task from the Wrapper plugin (see Chapter 48, Wrapper Plugin), which means that the Gradle Wrapper will also be installed into the project.
zh_cn: 它还利用了 Wrapper 插件的 wrapper 任务（见第 48章，Wrapper 插件），这意味着 Gradle Wrapper 也将被安装到该项目。

source: It also preserves the context and it is arguably the most readable.
zh_cn: 它也保留了上下文，且可以说是可读性最强的。

source: It assigns those configurations to tasks such as compileJava and test.
zh_cn: 它对一些任务指定了这些配置，如compileJava和test。

source: It automatically detects and executes all unit tests in the test source set.
zh_cn: 它会自动检测和执行test源集中的所有单元测试。

source: It can deal with Groovy code, mixed Groovy and Java code, and even pure Java code (although we don't necessarily recommend to use it for the latter).
zh_cn: 它可以处理 Groovy 代码，以及混合的 Groovy 和 Java 代码，甚至是纯 Java 代码（尽管我们不一定推荐使用）。

source: It can deal with Scala code, mixed Scala and Java code, and even pure Java code (although we don't necessarily recommend to use it for the latter).
zh_cn: 它可以处理 Scala 代码，以及混合的 Scala 和 Java 代码，甚至是纯 Java 代码（尽管我们不一定推荐使用）。

source: It can do things such as:
zh_cn: 它可以做的事情如：

source: It causes the other project to be built first and adds the jar with the classes of the other project to the classpath.
zh_cn: 它使其他项目先构建，并把其他项目的生成的 jar 文件添加到类路径中。

source: It could also come from a local lib directory, perhaps checked in to source control:
zh_cn: 它也可以获取自本地中可能检入版本控制的lib目录：

source: It creates a sample build.gradle file, with comments and links to help get started.
zh_cn: 它将创建一个示例build.gradle文件，并包含注释和链接以帮助你开始。

source: It depends on the repository type, which information is need for actually finding the dependencies in the repository.
zh_cn: 这取决于仓库类型，这些信息实际上需要用于在仓库中找到这个依赖。

source: It disables the default JAR archive generation of the Java plugin and adds a default WAR archive task.
zh_cn: 它禁用了 Java 插件生成默认的 JAR archive，并添加了一个默认的 WAR archive 任务。

source: It does not make sense to use libraries from different releasable units together.
zh_cn: 而一起使用来自不同的可发布单位的库，也不会有意义。

source: It doesn't require the Java plugin, but for projects that also use the Java plugin it disables the default JAR archive generation.
zh_cn: 它不需要 Java 插件，但是对于使用了 Java 插件的项目，它将禁用默认的 JAR archive 的生成。

source: It has no build script and gets nothing injected by another build script.
zh_cn: 它没有构建脚本，并且其他项目也没有向它注入内容。

source: It has the following features:
zh_cn: 它具有以下特点：

source: It holds all global configuration, most importantly server and database connection settings.
zh_cn: 它拥有所有全局配置，最重要的服务器和数据库的连接设置。

source: It implements the standard Gradle type Reporting and exposes a report container of type JacocoReportsContainer.
zh_cn: 它实现了标准的 Gradle 类型Reporting，并呈现了一个JacocoReportsContainer类型的报告容器。

source: It installs those archives to your local Maven repository.
zh_cn: 它将这些archives安装到你的本地 Maven 仓库中。

source: It is advisable to keep your username and password in gradle.properties rather than directly in the build file.
zh_cn: 最好是把你的用户名和密码写在gradle.properties中，而不是直接写在构建文件中。

source: It is also faster than analyzing each project separately.
zh_cn: 同时，它比单独分析每个项目更快。

source: It is also more accurate because a per-dependency exclude rule does not guarantee the given transitive dependency does not show up in the configuration.
zh_cn: 它也更准确，因为每个依赖排除规则并不能保证给定的传递依赖不会显示在配置中。

source: It is also possible for an Ant target to depend on a Gradle task:
zh_cn: 它也可以用于一个依赖于 Gradle 任务的 Ant 目标：

source: It is also possible to receive notifications when any project is evaluated.
zh_cn: 你也可以在每一个project 评估之后收到收到通知。

source: It is another layer of indirection.
zh_cn: 它是一个间接层。

source: It is based on the Sonar Runner, a Sonar client component that analyzes source code and build outputs, and stores all collected information in the Sonar database.
zh_cn: 它基于Sonar Runner，一个分析源代码及构建输出，并将所有收集的信息储存在 Sonar 数据库的 Sonar 客户端组件。

source: It is common to want to sign the artifacts of a configuration.
zh_cn: 签名一个配置的artifacts是很常见的情况。

source: It is currently incubating.
zh_cn: 目前它还在孵化中的状态。

source: It is done lazily, either when generating the jar, or by calling writeTo or effectiveManifest
zh_cn: 它是懒执行的，不管是对于生成一个jar包，还是调用了 writeTo 或者 effectiveManifest

source: It is easy to apply settings to all binaries of a particular type:
zh_cn: 让设置应用于指定类型的所有二进制文件很简单：

source: It is easy to iterate over the dependency artifacts of a configuration:
zh_cn: 它可以轻松地遍历一个配置的依赖 artifacts：

source: It is important to distinguish between the name of the archive task and the name of the archive generated by the archive task.
zh_cn: 区分归档任务的名称和归档任务生成的归档文件的名称是很重要的。

source: It is important to note that if you pass a closure to the getByName() method, this closure is applied to configure the task, not when the task executes.
zh_cn: 特别要注意的是，如果您向getByName()方法传入一个闭包，这个闭包的应用是在配置这个任务的时候，而不是任务执行的时候。

source: It is important to note that the content of a file collection is evaluated lazily, when it is needed.
zh_cn: 要注意的一个地方是，一个文件集合的内容是缓计算的，它只在需要的时候才计算。

source: It is important to note that the custom archives you are creating as part of your build are not automatically assigned to any configuration.
zh_cn: 重点注意：你所创建的作为构建中的一部分的自定义archives，不会自动地指向任何的配置。

source: It is important to note that the returned files of the copied configuration are often but not always the same than the returned files of the dependency subset of the original configuration.
zh_cn: 要重点注意，复制的配置所返回的文件，往往并不总是与原始配置的依赖子集所返回的文件一样。

source: It is important to note that those provided configurations work transitively.
zh_cn: 要特别注意，这些provided配置的传递使用。

source: It is inconvenient to add the task explicitly for every project.
zh_cn: 因为要为每一个project 添加任务显示很不方便。

source: It is ironic that in a language known for its rich library of open source components that Java has no concept of libraries or versions.
zh_cn: 令人啼笑皆非的是，以其丰富的开源组件库著称的语言，Java 竟然没有库或者版本的概念。

source: It is not a big deal to set-up a custom repository.
zh_cn: 想在设置一个自定义的仓库并不算什么。

source: It is not available for Maven repositories, or custom Ivy DependencyResolver implementations.
zh_cn: 它不能用于 Maven 仓库，或自定义的 Ivy DependencyResolver实现。

source: It is not necessary or possible to specify the tool chain that should be used to build.
zh_cn: 指定构建所使用的工具链是不必要和可能的。

source: It is only able to be used if there is a valid "pom.xml" file in the directory that the init task is invoked in.
zh_cn: 它仅用于当有一个有效的“pom.xml”文件在 init 任务被调用的目录的时候。

source: It is particularly effective when frequently compiling small code increments, as is often done at development time.
zh_cn: 频繁编译代码的增量部分是非常有用的，因为在开发时我们经常要这样做。

source: It is possible for different repositories to provide a different binary artifact in response to the same artifact identifier.
zh_cn: 不同的仓库提供不同的二进制构件以响应相同的构件标识符是可能的。

source: It is possible to execute tasks A and B independently.
zh_cn: 它是可以独立地执行任务A和B 的。

source: It is possible to override this on a per-component basis, by specifying the set of targetBuildTypes, targetPlatforms and/or targetFlavors.
zh_cn: 通过指定的 targetBuildTypes， targetPlatforms 或 targetFlavors，是可以在每一个组件的基础上进行重写的。

source: It is possible to use this property to create a task to generate all possible variants on a particular machine.
zh_cn: 可以用这个属性来创建一个任务，生成在某一特定计算机上所有可能的变种。

source: It is preferable to run this command from your Gradle project directory so that the settings of the UI will be stored in your project directory.
zh_cn: 最好是从Gradle项目目录运行此命令，这样对UI的设置就可以存储在你的项目目录中。

source: It is preferable to use the Copy task wherever possible, as it support incremental building and task dependency inference without any extra effort on your part.
zh_cn: 在可能的情况下，最好是使用Copy任务，因为它支持增量构建和任务依赖关系推理，而不需要你额外付出。

source: It is preferable to using new File(somePath), as file() always evaluates the supplied path relative to the project directory, which is fixed, rather than the current working directory, which can change depending on how the user runs Gradle.
zh_cn: 由于file()方法总是去计算所提供的路径相对于项目目录的路径，最好是使用new File(somePath)，因为它是一个固定的路径，而不会因为用户运行Gradle的具体工作目录而改变。

source: It is represented by the FileCollection interface.
zh_cn: 它通过FileCollection接口来表示。

source: It is represented by the FileTree interface.
zh_cn: 它通过FileTree接口表示。

source: It is required because in the settings file it is defined, which projects are taking part in the multi-project build (see Chapter 56, Multi-project Builds).
zh_cn: 因为在这个设置文件中，会定义哪些项目会加入这个多项目构建（见第56章，多项目构建）。

source: It is typically only applied to the root project.
zh_cn: 它通常只应用于根项目。

source: It is usually our favorite.
zh_cn: 它是我们通常最喜欢的方式。

source: It is, however, possible to analyze a different language for each project in a multi-project build.
zh_cn: 不过，在多项目构建中你可以为每一个项目分析一种不同的语言。

source: It makes full use of the type system, is more expressive and easier to maintain.
zh_cn: 它充分利用了类型系统，更具有表现力而且易于维护。

source: It may not be immediately apparent, but using key Gradle features like the allprojects and subprojects keywords automatically cause your projects to be coupled.
zh_cn: 它可能不明显，但使用关键的 Gradle 特性，像allprojects和subprojets关键字会自动导致你的项目耦合。

source: It must be explicitly specified.
zh_cn: 它必须显式指定。

source: It provides the syntax for the build.xml, the handling of the targets, special constructs like macrodefs, and so on.
zh_cn: 它提供了用于build.xml，处理的目标，特殊的构造方法比如宏，还有其他等等的语法。

source: It provides utmost flexibility to adapt Gradle to your unique needs.
zh_cn: 它提供了最大限度的灵活性，以满足你对Gradle的特殊需求。

source: It searches for a settings.gradle in a directory called master which has the same nesting level as the current dir.
zh_cn: 它将在一个与当前目录有相同嵌套层的叫做master的目录里面搜索settings.gradle

source: It serves as the basis for many of the other Gradle plugins.
zh_cn: 它是很多其他 Gradle 插件的基础服务。

source: It simply removes the directory denoted by its dir property.
zh_cn: 它只是删除由其dir属性表示的目录。

source: It stops the build afterwards if ignoreFailures is false and there are failing tests.
zh_cn: 如果ignoreFailures为 false，并且有测试不通过，那它会停止继续构建。

source: It supports creating brand new projects of different types as well as converting existing builds (e.g. An Apache Maven build) to be Gradle builds.
zh_cn: 它支持创建不同类型的全新项目，以及将现有的构建 (如 Apache Maven 构建) 转换成 Gradle 构建。

source: It supports the core javadoc options and the options of the standard doclet described in the reference documentation of the Javadoc executable.
zh_cn: 它支持核心的 javadoc 参数选项，以及在Javadoc可执行文件的参考文档中描述的标准 doclet 参数选项。

source: It then filters the retrieved files by specified dependencies.
zh_cn: 然后，由指定的依赖筛选获取的文件。

source: It turns out that in majority of cases you want to use the per-configuration exclusion.
zh_cn: 事实证明，在大多数情况下你想要排除每一个配置。

source: It will also be used to get hold of the Groovy compiler and Groovydoc tool, respectively.
zh_cn: 它还将用于分别获取Groovy 编译器及 Groovydoc 工具。

source: It will also be used to get hold of the Scala compiler and Scaladoc tool, respectively.
zh_cn: 它还将用于分别获取Scala 编译器及 Scaladoc 工具。

source: It will only aggregate the reporting tasks that are independently being executed as part of the build run.
zh_cn: 它只聚合作为构建的一部分正在独立运行的报告任务。

source: It works the same way as the task with some major limitations though.
zh_cn: 它是与任务一样的工作方式，尽管它有一些主要的限制。

source: It's because workspace contains a lot of user specific temporary data and typically it is not desirable to manipulate it outside IDEA.
zh_cn: 这是因为工作区包含大量的用户特定的临时数据，在 IDEA 之外操纵它的做法通常是不可取的。

source: Ivy repository
zh_cn: Ivy 仓库

source: Ivy's dependency descriptor (ivy.xml) can declare multiple artifacts.
zh_cn: Ivy 的依赖描述符（ivy.xml）可以定义多个 artifact。

source: JARs and WARs are generated into project.buildDir/libraries.
zh_cn: JAR包和 WAR包会生成到 project.buildDir/libraries中。

source: JUnit and TestNG allows sophisticated groupings of test methods.
zh_cn: JUnit 和 TestNG 可以对测试方法进行复杂的分组。

source: JUnit and TestNG are both supported.
zh_cn: 同时支持 JUnit 和 TestNG。

source: JVM options
zh_cn: JVM 选项

source: Java Quickstart
zh_cn: Java 快速入门

source: Java plugin - dependency configurations
zh_cn: Java插件 ​​- 依赖配置

source: Java plugin - tasks
zh_cn: Java插件 ​​- 任务

source: Java source for the given source set
zh_cn: 给定的源集的Java源代码

source: Java version compatibility to use when compiling Java source.
zh_cn: 当编译Java源代码时所使用的Java版本兼容性。

source: Java version to generate classes for.
zh_cn: 要生成的类的 Java 版本。

source: Jetty plugin - tasks
zh_cn: Jetty插件 - tasks

source: Just enter whatever you would normally enter after 'gradle' on the command line.
zh_cn: 你只需要输入命令行中你经常在“Gradle”后面输入的命令即可。

source: Just like Gradle's Ant based compiler, the Zinc based compiler supports joint compilation of Java and Scala code.
zh_cn: 就像Gradle 上基于Ant 的编译器一样，基于 Zinc 的编译器支持 Java 和 Scala 代码的联合编译。

source: Just like the Java plugin, the Groovy plugin allows to configure custom locations for Groovy production and test sources.
zh_cn: 和 Java 插件一样，Groovy 插件允许把 Groovy 的production 和test 的源文件配置为自定义的位置。

source: Just like the Java plugin, the Scala plugin allows to configure custom locations for Scala production and test sources.
zh_cn: 和 Java 插件一样，Scala 插件允许把 Scala 的production 和test 的源文件配置为自定义的位置。

source: LIFECYCLE and higher
zh_cn: LIFECYCLE 及更高

source: Language for dependency based programming
zh_cn: 基于编程的依赖语言

source: Language plugins
zh_cn: 语言插件

source: Later in this chapter we explain how Gradle looks for a settings file.
zh_cn: 在本章后面，我们会解释 Gradle 是怎么查找一个设置文件的。

source: Legal Notice
zh_cn: 法律公告

source: Let's add a property to the task, so we can customize it.
zh_cn: 让我们添加一个属性到这个任务中，这样我们就可以自定义它。

source: Let's add a task to bluewhale and krill.
zh_cn: 我们先将任务添加到bluewhale和krill。

source: Let's assume your project produces just the default jar file.
zh_cn: 让我们假设你的项目只是产生默认的 jar 文件。

source: Let's change the naming of our tasks and execute the build.
zh_cn: 让我们改变我们的任务的命名，执行构建。

source: Let's check this out:
zh_cn: 让我们来看看：

source: Let's first add another project called krill to our multi-project build.
zh_cn: 让我们先添加另一个叫做krill的项目到我们的多项目构建中。

source: Let's first do some introspection with a single project build:
zh_cn: 我们先来看一个一个单项目构建：

source: Let's have a look at an example.
zh_cn: 让我们来看一个例子。

source: Let's have one more example with our producer-consumer build before we enter Java land.
zh_cn: 让我们在进入Java领域之前，有更多的生产者-消费者构建的例子。

source: Let's look at an example.
zh_cn: 让我们来看一个例子。

source: Let's look at the build script for the water project and execute it:
zh_cn: 让我们看看water项目的构建脚本并执行它︰

source: Let's now have our last marine example.
zh_cn: 现在让我们讲最后一个marine的例子。

source: Let's refactor and also add some project specific behavior to the krill project.
zh_cn: 让我们重构并且向krill项目添加一些项目特定的行为。

source: Let's run it a couple of times.
zh_cn: 让我们运行它几次。

source: Let's say you add commons-httpclient:commons-httpclient:3.0 to any of the provided configurations.
zh_cn: 假设你添加commons-httpclient:commons-httpclient:3.0依赖到任何一个provided配置。

source: Let's say you already have the application.xml and want to use it instead of configuring the ear.deploymentDescriptor section.
zh_cn: 假设你已经有了application.xml ，并且想要使用它而不是去配置ear.deploymentDescriptor代码段。

source: Let's say your project is a library and you want this library to be uploaded to your company's Maven or Ivy repository.
zh_cn: 假设你的项目是一个库，你想要这个库上传到你公司的 Maven 或Ivy 仓库。

source: Let's say, you declare a dependency on the junit:junit:3.8.2 library.
zh_cn: 比方说，你可以声明一个junit:junit:3.8.2库的依赖。

source: Let's start with a very simple multi-project build.
zh_cn: 让我们从一个非常简单的多项目构建开始。

source: Let's switch to the bluewhale dir and see what happens if we execute Gradle from there.
zh_cn: 让我们切换到bluewhale目录，看看如果我们从那里执行 Gradle 会发生什么。

source: Let's take a closer look at the sonarRunner.sonarProperties {} block.
zh_cn: 让我们再详细看看sonarRunner.sonarProperties {}块。

source: Let's try this out and try to access the name property of the Project object.
zh_cn: 下面我们来试试这个，试试访问Project对象的name属性。

source: Let's try to solve this with a hack and rename the producer project to aProducer.
zh_cn: 让我们试着用一个技巧解决这个问题，并将生产者项目命名为aProducer。

source: Let's use the project structure shown in Example 56.25, “Project lib dependencies”.
zh_cn: 让我们使用示例 56.25，“项目库依赖”中显示的项目结构。

source: Let's zoom into configuration and execution phases of a multi-project build.
zh_cn: 让我们放大一个多项目构建的配置和执行阶段。

source: Lifecycle task
zh_cn: 生命周期任务

source: Like dependencies, artifacts are grouped by configurations.
zh_cn: 像依赖一样，构件也按配置进行分组。

source: Line 3 of the example is just a shortcut for the tasks.getByName() method.
zh_cn: 该例子的第 3 行只是tasks.getByName()方法的简洁写法。

source: Live visualisation of the build in a GUI
zh_cn: 在 GUI 中的实时可视化构建

source: Local Groovy dependency
zh_cn: 本地的 Groovy 依赖

source: Local variables are a feature of the underlying Groovy language.
zh_cn: 局部变量是Groovy 语言底层的一个特征。

source: Local variables are declared with the def keyword.
zh_cn: 局部变量是用def关键字声明的。

source: Locating files
zh_cn: 查找文件

source: Locating tasks
zh_cn: 查找任务

source: Location of created binary
zh_cn: 创建二进制文件的位置

source: Logging
zh_cn: 日志

source: Logging for the other interfaces is left untouched.
zh_cn: 其他接口的日志记录是不变的。

source: Logging from external tools and libraries
zh_cn: 使用外部的工具和类库来记录日志

source: Manifest are merged in the order they are declared by the from statement.
zh_cn: Manifest会根据在from语句中所声明的顺序进行合并。

source: Manipulating existing tasks
zh_cn: 操纵现有任务

source: Many Ant tasks set properties when they execute.
zh_cn: 许多 Ant 任务在执行时会设置一些属性。

source: Many Gradle plugin add pre-defined configurations to your project.
zh_cn: 许多 Gradle 插件会向你的 project 添加预定义的配置。

source: Many objects in Gradle have properties which accept a set of input files.
zh_cn: Gradle 中的许多对象都有一个接受一组输入文件的属性。

source: Many objects in the Gradle API implement this interface.
zh_cn: Gradle API 中的许多对象都实现了此接口。
